---
kind: property
id: P:Autodesk.Revit.UI.UIApplication.LoadedApplications
source: html/4f740794-5f0f-a17b-3620-3695606b5ac5.htm
---
# Autodesk.Revit.UI.UIApplication.LoadedApplications Property

Returns an array of successfully loaded external applications.

## Syntax (C#)
```csharp
public virtual ExternalApplicationArray LoadedApplications { get; }
```

## Remarks
This property can be used by your application to find all successfully
loaded external applications when Revit starts.